app/controllers/comics_controller.rb

  def index
    @comics = Comic.all(:order=>"FIELD(status, 'errored', 'enabled', 'disabled'), error_count, name", :include=>:strips)
---
SELECT * FROM `comics` ORDER BY enabled DESC, name
SELECT `strips`.* FROM `strips` WHERE (`strips`.comic_id IN (4,5,3)) ORDER BY date
SELECT count(*) AS count_all FROM `strips` WHERE (`strips`.comic_id = 4)

  def debug
    @comic = Comic.find(params[:id])
---
SELECT * FROM `comics` WHERE (`comics`.`id` = 4)